-----------------------------------------------------------------------------------------------------------------------------------------
-- DRUGS
-----------------------------------------------------------------------------------------------------------------------------------------
DrugsPermission = "Policia"
DrugsItem = "dollarsroll"
DrugsInfluencesBonus = 0.1
NoSellingDrugs = {
    "Policia",
    "Mecanica",
    "Emergencia"
}
-----------------------------------------------------------------------------------------------------------------------------------------
-- DRUGSINFLUENCES
-----------------------------------------------------------------------------------------------------------------------------------------
DrugsInfluences = {
	{ 1272.26, -1712.57, 54.76, 250 },
	{ 95.58, -1985.56, 20.44, 250 },
	{ -31.47, -1434.84, 31.49, 250 },
	{ 347.45, -2069.06, 20.89, 250 },
	{ 512.29, -1803.52, 28.51, 250 },
	{ 230.55, -1753.35, 28.98, 250 },
    { -1253.68, -1436.69, 7.85, 250 }
}
-----------------------------------------------------------------------------------------------------------------------------------------
-- MESSAGES
-----------------------------------------------------------------------------------------------------------------------------------------
Messages = {
    'Eae, meu chapa! Tô em busca daquele conteúdo diferenciado, sabe? Tem a parada da boa pra vender? 👀💨',
    'Oi, boa noite me vê 2 Ck de 20 cria? 🌬️💨',
    'Oba oba, 4 po de 5 família? 🌬️💨',
    'Coe cria bom, tem skank paizão? Me vê 2 ai paizão? 🌬️💨',
    'Parada de 20 pai a forte? 🌬️💨',
    'Matin de 10 mano, me da uma aí? 🌬️💨',
    'cria tem? É quanto? Me da um ai paizão? 🌬️💨',
    'Solta a braba de galo aí pra nois marola no baile mais tarde? 🌬️💨',
    'Me vé uma Droga ai? 🌬️💨',
    'Boa me vé um Chá? 🌬️💨',
    'Tem de 10 padrinho? 🌬️💨',
    'Tem 2 do bom Chefe? 🌬️💨',
    'Tem a braba ai? 🌬️💨',
    'Visão da boca tem droga? 🌬️💨',
    'Fé, droga de 20 cria? 🌬️💨'
}
-----------------------------------------------------------------------------------------------------------------------------------------
-- DRUGSLIST
-----------------------------------------------------------------------------------------------------------------------------------------
DrugsList = {
	["cocaine"] = {
		Price = { ["Min"] = 450, ["Max"] = 650},
		Amount = { ["Min"] = 2, ["Max"] = 4 }
	},
	["crack"] = {
		Price = { ["Min"] = 450, ["Max"] = 650},
		Amount = { ["Min"] = 2, ["Max"] = 4 }
	},
	["heroin"] = {
		Price = { ["Min"] = 450, ["Max"] = 650},
		Amount = { ["Min"] = 2, ["Max"] = 4 }
	},
	["joint"] = {
		Price = { ["Min"] = 450, ["Max"] = 650},
		Amount = { ["Min"] = 2, ["Max"] = 4 }
	},
	["lean"] = {
		Price = { ["Min"] = 450, ["Max"] = 650},
		Amount = { ["Min"] = 2, ["Max"] = 4 }
	},
	["metadone"] = {
		Price = { ["Min"] = 450, ["Max"] = 650},
		Amount = { ["Min"] = 2, ["Max"] = 4 }
	},
	["meth"] = {
		Price = { ["Min"] = 450, ["Max"] = 650},
		Amount = { ["Min"] = 5, ["Max"] = 5 }
	},
	["oxy"] = {
		Price = { ["Min"] = 450, ["Max"] = 650},
		Amount = { ["Min"] = 2, ["Max"] = 4 }
	},
	["lancaperfume"] = {
		Price = { ["Min"] = 450, ["Max"] = 650},
		Amount = { ["Min"] = 2, ["Max"] = 4 }
	}
}